tutorials/natConvBoxCloud/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

T_air       297;
dT 3;
T_bottom  #eval{$T_air + $dT};

internalField   uniform $T_air;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    bottom
    {
        type            fixedValue;
        value           uniform $T_bottom;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform $T_air;
        value           uniform $T_air;
    }

}


// ************************************************************************* //
