tutorials/natConvBoxCloud/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver  GAMG;
        smoother        GaussSeidel;
        relTol  1.0E-2;
        cacheAgglomeration      true;
        nFinestSweeps   2;
        nPreSweeps      1;
        maxIter 1000;
        nPostSweeps     2;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel   10;
        tolerance       1.0E-7;
        mergeLevels     1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol 0;
    }

    "(U|T|k|omega)"
    {
        solver          PBiCGStab;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          1e-2;
    }

    UFinal
    {
        $U;
        relTol 0;
    }
    TFinal
    {
        $U;
        relTol 0;
    }
    kFinal
    {
        $U;
        relTol 0;
    }
    omegaFinal
    {
        $U;
        relTol 0;
    }
}
PIMPLE
{
    nOuterCorrectors 10;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    turbOnFinalIterOnly true;

    residualControl
    {
        "(U|k|epsilon|omega)"
        {
            tolerance   1e-3;
            relTol      0;
        }
        p
        {
            tolerance   1e-2;
            relTol      0;
        }
    }

    pRefCell        0;
    pRefValue       0;
}
SIMPLE
{

    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-2;
        U               1e-3;
        T               1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.5;
    }
    equations
    {
        U               0.8;
        T               0.9;
        k               0.8;
        omega           0.8;
    }
}


// ************************************************************************* //
